###################################################################

# Created by write_sdc on Sat Jan 3 18:38:46 2015

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_max_capacitance 0.0207768 [current_design]
set_max_area 0
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[23]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[22]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[21]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[20]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[19]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[18]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[17]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[16]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[15]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[14]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[13]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[12]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[11]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[10]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[9]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[8]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[7]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[6]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[5]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[4]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[3]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[2]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[1]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code2_proc2[0]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[23]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[22]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[21]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[20]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[19]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[18]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[17]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[16]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[15]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[14]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[13]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[12]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[11]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[10]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[9]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[8]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[7]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[6]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[5]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[4]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[3]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[2]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[1]}]
set_driving_cell -lib_cell LVT_DRNHSV2 -pin Q [get_ports {ins_code1_proc1[0]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc1_code1[7]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc1_code1[6]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc1_code1[5]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc1_code1[4]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc1_code1[3]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc1_code1[2]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc1_code1[1]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc1_code1[0]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc2_code2[7]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc2_code2[6]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc2_code2[5]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc2_code2[4]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc2_code2[3]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc2_code2[2]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc2_code2[1]}]
set_load -pin_load 0.00794165 [get_ports {pc_proc2_code2[0]}]
set_ideal_network [get_ports clk]
set_ideal_network [get_ports reset]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_clock_latency 0.05  [get_clocks clk]
set_clock_uncertainty 0.05  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
group_path -name INPUTS  -from [get_ports reset]
group_path -name INPUTS  -from [list [get_ports clk] [get_ports {ins_code2_proc2[23]}] [get_ports {ins_code2_proc2[22]}] [get_ports {ins_code2_proc2[21]}] [get_ports {ins_code2_proc2[20]}] [get_ports {ins_code2_proc2[19]}] [get_ports {ins_code2_proc2[18]}] [get_ports {ins_code2_proc2[17]}] [get_ports {ins_code2_proc2[16]}] [get_ports {ins_code2_proc2[15]}] [get_ports {ins_code2_proc2[14]}] [get_ports {ins_code2_proc2[13]}] [get_ports {ins_code2_proc2[12]}] [get_ports {ins_code2_proc2[11]}] [get_ports {ins_code2_proc2[10]}] [get_ports {ins_code2_proc2[9]}] [get_ports {ins_code2_proc2[8]}] [get_ports {ins_code2_proc2[7]}] [get_ports {ins_code2_proc2[6]}] [get_ports {ins_code2_proc2[5]}] [get_ports {ins_code2_proc2[4]}] [get_ports {ins_code2_proc2[3]}] [get_ports {ins_code2_proc2[2]}] [get_ports {ins_code2_proc2[1]}] [get_ports {ins_code2_proc2[0]}] [get_ports {ins_code1_proc1[23]}] [get_ports {ins_code1_proc1[22]}] [get_ports {ins_code1_proc1[21]}] [get_ports {ins_code1_proc1[20]}] [get_ports {ins_code1_proc1[19]}] [get_ports {ins_code1_proc1[18]}] [get_ports {ins_code1_proc1[17]}] [get_ports {ins_code1_proc1[16]}] [get_ports {ins_code1_proc1[15]}] [get_ports {ins_code1_proc1[14]}] [get_ports {ins_code1_proc1[13]}] [get_ports {ins_code1_proc1[12]}] [get_ports {ins_code1_proc1[11]}] [get_ports {ins_code1_proc1[10]}] [get_ports {ins_code1_proc1[9]}] [get_ports {ins_code1_proc1[8]}] [get_ports {ins_code1_proc1[7]}] [get_ports {ins_code1_proc1[6]}] [get_ports {ins_code1_proc1[5]}] [get_ports {ins_code1_proc1[4]}] [get_ports {ins_code1_proc1[3]}] [get_ports {ins_code1_proc1[2]}] [get_ports {ins_code1_proc1[1]}] [get_ports {ins_code1_proc1[0]}]]
group_path -name OUTPUTS  -to [list [get_ports {pc_proc1_code1[7]}] [get_ports {pc_proc1_code1[6]}] [get_ports {pc_proc1_code1[5]}] [get_ports {pc_proc1_code1[4]}] [get_ports {pc_proc1_code1[3]}] [get_ports {pc_proc1_code1[2]}] [get_ports {pc_proc1_code1[1]}] [get_ports {pc_proc1_code1[0]}] [get_ports {pc_proc2_code2[7]}] [get_ports {pc_proc2_code2[6]}] [get_ports {pc_proc2_code2[5]}] [get_ports {pc_proc2_code2[4]}] [get_ports {pc_proc2_code2[3]}] [get_ports {pc_proc2_code2[2]}] [get_ports {pc_proc2_code2[1]}] [get_ports {pc_proc2_code2[0]}]]
set_false_path   -from [get_ports reset]
set_max_delay 1  -from [list [get_ports clk] [get_ports reset] [get_ports {ins_code2_proc2[23]}] [get_ports {ins_code2_proc2[22]}] [get_ports {ins_code2_proc2[21]}] [get_ports {ins_code2_proc2[20]}] [get_ports {ins_code2_proc2[19]}] [get_ports {ins_code2_proc2[18]}] [get_ports {ins_code2_proc2[17]}] [get_ports {ins_code2_proc2[16]}] [get_ports {ins_code2_proc2[15]}] [get_ports {ins_code2_proc2[14]}] [get_ports {ins_code2_proc2[13]}] [get_ports {ins_code2_proc2[12]}] [get_ports {ins_code2_proc2[11]}] [get_ports {ins_code2_proc2[10]}] [get_ports {ins_code2_proc2[9]}] [get_ports {ins_code2_proc2[8]}] [get_ports {ins_code2_proc2[7]}] [get_ports {ins_code2_proc2[6]}] [get_ports {ins_code2_proc2[5]}] [get_ports {ins_code2_proc2[4]}] [get_ports {ins_code2_proc2[3]}] [get_ports {ins_code2_proc2[2]}] [get_ports {ins_code2_proc2[1]}] [get_ports {ins_code2_proc2[0]}] [get_ports {ins_code1_proc1[23]}] [get_ports {ins_code1_proc1[22]}] [get_ports {ins_code1_proc1[21]}] [get_ports {ins_code1_proc1[20]}] [get_ports {ins_code1_proc1[19]}] [get_ports {ins_code1_proc1[18]}] [get_ports {ins_code1_proc1[17]}] [get_ports {ins_code1_proc1[16]}] [get_ports {ins_code1_proc1[15]}] [get_ports {ins_code1_proc1[14]}] [get_ports {ins_code1_proc1[13]}] [get_ports {ins_code1_proc1[12]}] [get_ports {ins_code1_proc1[11]}] [get_ports {ins_code1_proc1[10]}] [get_ports {ins_code1_proc1[9]}] [get_ports {ins_code1_proc1[8]}] [get_ports {ins_code1_proc1[7]}] [get_ports {ins_code1_proc1[6]}] [get_ports {ins_code1_proc1[5]}] [get_ports {ins_code1_proc1[4]}] [get_ports {ins_code1_proc1[3]}] [get_ports {ins_code1_proc1[2]}] [get_ports {ins_code1_proc1[1]}] [get_ports {ins_code1_proc1[0]}]]  -to [list [get_ports {pc_proc1_code1[7]}] [get_ports {pc_proc1_code1[6]}] [get_ports {pc_proc1_code1[5]}] [get_ports {pc_proc1_code1[4]}] [get_ports {pc_proc1_code1[3]}] [get_ports {pc_proc1_code1[2]}] [get_ports {pc_proc1_code1[1]}] [get_ports {pc_proc1_code1[0]}] [get_ports {pc_proc2_code2[7]}] [get_ports {pc_proc2_code2[6]}] [get_ports {pc_proc2_code2[5]}] [get_ports {pc_proc2_code2[4]}] [get_ports {pc_proc2_code2[3]}] [get_ports {pc_proc2_code2[2]}] [get_ports {pc_proc2_code2[1]}] [get_ports {pc_proc2_code2[0]}]]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[23]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[23]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[22]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[22]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[21]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[21]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[20]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[20]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[19]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[19]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[18]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[18]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[17]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[17]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[16]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[16]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[15]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[15]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[14]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[14]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[13]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[13]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[12]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[12]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[11]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[11]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[10]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[10]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[9]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[9]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[8]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[8]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[7]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[7]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[6]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[6]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[5]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[5]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[4]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[4]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[3]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[3]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[2]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[2]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[1]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[1]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code2_proc2[0]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code2_proc2[0]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[23]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[23]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[22]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[22]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[21]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[21]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[20]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[20]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[19]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[19]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[18]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[18]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[17]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[17]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[16]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[16]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[15]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[15]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[14]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[14]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[13]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[13]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[12]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[12]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[11]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[11]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[10]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[10]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[9]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[9]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[8]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[8]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[7]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[7]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[6]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[6]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[5]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[5]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[4]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[4]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[3]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[3]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[2]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[2]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[1]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[1]}]
set_input_delay -clock clk  -max 0.1  [get_ports {ins_code1_proc1[0]}]
set_input_delay -clock clk  -min 0.05  [get_ports {ins_code1_proc1[0]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc1_code1[7]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc1_code1[7]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc1_code1[6]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc1_code1[6]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc1_code1[5]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc1_code1[5]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc1_code1[4]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc1_code1[4]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc1_code1[3]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc1_code1[3]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc1_code1[2]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc1_code1[2]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc1_code1[1]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc1_code1[1]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc1_code1[0]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc1_code1[0]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc2_code2[7]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc2_code2[7]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc2_code2[6]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc2_code2[6]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc2_code2[5]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc2_code2[5]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc2_code2[4]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc2_code2[4]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc2_code2[3]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc2_code2[3]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc2_code2[2]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc2_code2[2]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc2_code2[1]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc2_code2[1]}]
set_output_delay -clock clk  -max 0.1  [get_ports {pc_proc2_code2[0]}]
set_output_delay -clock clk  -min 0.05  [get_ports {pc_proc2_code2[0]}]
